app/controllers/active_users_controller.rb

SELECT * FROM "users" WHERE (perishable_token = 'BQrrl7w4Xcfs_JuwWG-r' and updated_at > '2009-07-27 18:38:37') LIMIT 1
UPDATE "users" SET "updated_at" = '2009-07-27 18:48:37', "perishable_token" = 'hKq9iZHRhZgJlkh4aJcf', "status" = 't' WHERE "id" = 10
---
	def edit
		@user = User.find_using_perishable_token(params[:id])
		if @user
			if @user.update_attributes(:status => true)