app/controllers/password_resets_controller.rb

SELECT * FROM "users" WHERE ("users"."email" = 'diegoalvareznogueira@gmail.com') LIMIT 1
---
	def create
		@user = User.search(:email => params[:email])

UPDATE "users" SET "persistence_token" = 'df61630d7098ea5880bb0875dfb3aa50b02d5add548b13cf4315fa8e1cb69d155e99d05b25f781ccad0486e31d6d96708c2d6b05ee8cc232c792ac50f1a279f3', "updated_at" = '2009-07-27 19:10:22', "perishable_token" = '7-Z-H_Ynl_zsZZNM0ABl', "password_salt" = 'B9ZJFlQMfgd7t4mhtvk-', "crypted_password" = '276fb19ba72a4bccc53c398c23539530df1307732618d54fde6c660b4f9354622a304953e85623fb4a6a7e73db2cf4af782fe0e3848721d5bd10db768cd3362f' WHERE "id" = 12
---
	def update
		@user.password = params[:user][:password]
		@user.password_confirmation = params[:user][:password_confirmation]
		if @user.save

SELECT * FROM "users" WHERE (perishable_token = 'u8jltuVCAWL5wRn3k2kl' and updated_at > '2009-07-27 19:00:22') LIMIT 1
---
	def load_user_using_perishable_token
		@user = User.find_using_perishable_token(params[:id])