app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '12') LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "perishable_token", "password_salt", "persistence_token", "login", "status", "email") VALUES('2009-07-27 18:42:05', '494f97d3ba60b6302b02425b820df47fc16796506c5413847ac1b26be57d460322d1cb07e3d5783f121f0aab60e902d4d375d53135a10714fd5819c664989ff5', '2009-07-27 18:42:05', 'DJiKYEpSN9ZYK7xo9LAZ', 'EuHT1m_FB5R34KKKC90p', 'ed071159bbc99bac59ef63d9a6e0710a4368fabb90eed18387f168404b1a646f212e0fc22686799025f4cb5635ea419087ddbf42c2a012dff64be3446096df67', 'diego', 'f', 'diegoalvareznogueira@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save